# CLI tools
brew "gh"
brew "mise"
brew "dolt"
brew "mas"
brew "steveyegge/beads/bd"

# GUI apps (install 1Password first — needed for auth flows)
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "ghostty"
cask "alfred"
cask "claude"
cask "claude-code"
cask "rectangle-pro"
cask "tailscale-app"
cask "jump-desktop"

# Mac App Store apps
mas "Mail for Gmail", id: 1587583867
