# CLI tools
brew "gh"
brew "mise"
brew "dolt"
brew "mas"
brew "uv"
brew "ruff"
brew "steveyegge/beads/bd"

# GUI apps (install 1Password first — needed for auth flows)
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "ghostty"
cask "alfred"
cask "claude"
cask "claude-code@latest"
cask "rectangle-pro"
cask "tailscale-app"
cask "jump-desktop"
cask "visual-studio-code"
cask "discord"

# Mac App Store apps
cask "mimestream"
# mas "Mail for Gmail", id: 1587583867  # TODO: fix Apple ID issue (dotfiles-u58)
